#+Title: Computer Science 3MI3 – 2020 homework 5
#+Subtitle: “Fizzbuzz”-ing in Ruby
#+Author: Mark Armstrong
#+Date: October 12th, 2020
#+Description: Iterating on a simple programming task in Ruby.
#+Options: num:nil
#+SETUPFILE: ../org-html-themes/setup/theme-readtheorg-local.setup

* Part 2: Fizzbuzzing by iterators (higher-order methods) [10 points]
:PROPERTIES:
:CUSTOM_ID: Part-2:-Fizzbuzzing-by-iterators-(higher-order-methods)-[10 points]
:END:

Construct another method ~fizzbuzzIterator~,
whose behaviour is identical to ~fizzbuzzLooper~,
but which is defined using an “iterator” method
rather than a looping construct.

See this online
[[https://ruby-doc.com/docs/ProgrammingRuby/html/tut_containers.html][tutorial]]
on collections and iterators.
In particular, look into the iterators ~each~ and ~collect~.

These iterators take a /block/ as argument.
A block is, essentially, Ruby's “lambda” construct.
Blocks are delimited by braces, ~{}~, and may have
arguments, which are listed at the beginning and
delimited by pipes, ~||~.
So the anonymous function ~λ x → x + 1~ would
be written ~{ |x| x + 1 }~ in Ruby.

So for instance,
#+begin_src ruby :results output
[1,2,3].each { |x| puts(x) }
#+end_src

#+RESULTS:
: 1
: 2
: 3

outputs each element of the list ~[1,2,3]~.

** The tests
:PROPERTIES:
:CUSTOM_ID: The-tests
:END:

The contents of the testing script are repeated here.

[[./testing/h5/h5t.rb][h5t.rb]]
#+begin_src ruby :results output :tangle ./testing/h5/h5t.rb
require_relative "h5"
require "test/unit"

# BEGIN constants for use in testing ---------------------------
# We use global variables, which is not recommended in Ruby,
# but which makes it simpler to share these values here.
$upto15 = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]

$upto15_fizzbuzzed = ["fizzbuzz","1","2","fizz","4","buzz",
                     "fizz","7","8","fizz","buzz",
                     "11","fizz","13","14","fizzbuzz"]

$fizzbuzz_rules = [[lambda { |x| x % 3 == 0 }, lambda { |x| "fizz" }],
                   [lambda { |x| x % 5 == 0 }, lambda { |x| "buzz" }]]
# END constants for use in testing -----------------------------

# BEGIN fizzbuzzLooper tests -----------------------------------
class TestLooper < Test::Unit::TestCase

  def test_simple
    assert_equal($upto15_fizzbuzzed,fizzbuzzLooper($upto15))
  end

end
# END fizzbuzzLooper tests -------------------------------------

# BEGIN fizzbuzzLooper tests -----------------------------------
class TestIterator < Test::Unit::TestCase

  def test_simple
    assert_equal($upto15_fizzbuzzed,fizzbuzzIterator($upto15))
  end

end
# END fizzbuzzLooper tests -------------------------------------

# BEGIN fizzbuzzLooper tests -----------------------------------
class TestZuzzer < Test::Unit::TestCase

  def test_simple
    assert_equal($upto15_fizzbuzzed,zuzzer($upto15,$fizzbuzz_rules))
  end

end
# END fizzbuzzLooper tests -------------------------------------
#+end_src

#+RESULTS:
#+begin_example
1
2
3
4
buzz
6
7
8
9
buzz
11
12
13
14
buzz
#+end_example

